ERP.belugaerp/src/Catalogs/битПунктыНазначения/битПунктыНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битПунктыНазначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>GLNКодМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГеокодирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйСрокДоОкончанияЛицензии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаРазгрузкиСтраховойКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторCRM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
      <types>CatalogRef.бг_УдалитьКаналыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТТSY</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛичноеПоручительствоПунктаРазгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.бг_МаршрутыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЛогист</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменСМТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСБ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.битТерриторииПунктовНазначения</types>
      <types>CatalogRef.бг_УдалитьТерриторииПунктовНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьАктПерегрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонMarker2ПакетаSOLVOWMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонMarkerПакетаSOLVOWMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАльтернативныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоФилиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_МенеджерыПунктовНазначения/бг_МенеджерыПунктовНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МенеджерыПунктовНазначения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутТорговогоПредставителя</name>
    <type>
      <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакЭТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Catalogs/битПунктыНазначения/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Партнер") Тогда
		Партнер = Параметры.Партнер;
		СписокПартнеров = Новый СписокЗначений;
		ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(Партнер, СписокПартнеров);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Партнер",
			СписокПартнеров,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина);
			
	ИначеЕсли Параметры.Отбор.Свойство("Клиент") Тогда
		Клиент = Параметры.Отбор.Клиент;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Клиент",
			"Видимость", Ложь);
			
	ИначеЕсли Параметры.Отбор.Свойство("Организация") Тогда
		Клиент = Параметры.Отбор.Организация;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Клиент",
			Клиент,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
			
	КонецЕсли;
	
	УстановитьВидимостьКомандыУстановкиМенеджера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьМенеджера(Команда)
	
	ОткрытьФорму(
		"Справочник.битПунктыНазначения.Форма.ФормаВыбораМенеджера", 
		Новый Структура, 
		ЭтаФорма, 
		,
		,
		,
		Новый ОписаниеОповещения(
			"УстановитьМенеджераЗавершение", 
			ЭтаФорма));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьМенеджераЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМенеджераВПунктахНазначения(ВыбранноеЗначение);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМенеджераВПунктахНазначения(ДанныеВыбора)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ПунктНазначения Из ВыделенныеСтроки Цикл
		РегистрыСведений.бг_МенеджерыПунктовНазначения.СоздатьЗаписьМенеджераПунктаНазначения(
			ПунктНазначения, ДанныеВыбора.Менеджер, , , ДанныеВыбора.ДатаНачалаДействия);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандыУстановкиМенеджера()
	
	Элементы.УстановитьМенеджера.Видимость = Пользователи.РолиДоступны("бг_ГрупповоеИзменениеМенеджеровПунктовНазначения");
	
КонецПроцедуры

#КонецОбласти
